export const MONTHS = [
  'Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь',
  'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'
]

export const MONTHS_SHORT = ['янв', 'фев', 'мар', 'апр', 'май', 'июн', 'июл', 'авг', 'сен', 'окт', 'ноя', 'дек']

export const WEEKDAYS = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс']

export const YEARS = [2024, 2025, 2026, 2027, 2028, 2029, 2030]

export const HOLIDAYS: { [key: string]: number[] } = {
  '0': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
  '1': [23],
  '2': [8],
  '4': [1, 9],
  '5': [12],
  '10': [4],
}
